protected/components/ShadowWidget.php

SELECT * FROM `tbl_shadow` WHERE (`to_id`=1) AND (`state_id`=1)
---
	public function run() {
		if (\Yii::$app->user->isGuest)
			return true;
			$currentuser = Yii::$app->user->identity;
			$id = Yii::$app->session->get ( "shadow" );

			$shadow = Shadow::find ()->where ( [
					// 'id' =>$id,
					'to_id' => Yii::$app->user->id,
					'state_id' => Shadow::STATE_ACTIVE
			] )->one ();