protected/controllers/LogController.php

INSERT INTO `tbl_log` (`link`, `error`, `description`, `type_id`, `created_on`) VALUES ('404:  /Kindworker/themes/green/js/switchery/switchery-init.js', 'Page not found.', '#0 C:\\xampp\\htdocs\\Kindworker\\vendor\\yiisoft\\yii2\\base\\Application.php(380): yii\\web\\Application->handleRequest(Object(yii\\web\\Request))\n#1 C:\\xampp\\htdocs\\Kindworker\\index.php(9): yii\\base\\Application->run()\n#2 {main}', 0, '2017-12-17 08:02:28')
---
    public function actionCustomError() {
    	$exception = Yii::$app->errorHandler->exception;

    	if ($exception !== null) {

    		$log = new Log ();

    		$log->link = $exception->statusCode . ":  " . \yii::$app->request->url;
    		$log->error = $exception->getMessage ();
    		$log->description = $exception->getTraceAsString ();

    		if (\Yii::$app->controller->module->id == 'api') {
    			$log->type_id = Log::TYPE_API;
    		} else {
    			$log->type_id = Log::TYPE_WEB;
    		}
    		$log->save ();