protected/controllers/UserController.php

SELECT * FROM `tbl_user` WHERE (`is_fill`=1) AND (`is_notify`=0)
---
	public function actionToastNotification() {
		\Yii::$app->response->format = 'json';
		$model = User::find ()->where ( [
				'is_fill' => User::IS_FILL,
				'is_notify' => User::NOT_FILL
		] )->all ();