protected/modules/api/controllers/CategoryController.php

SELECT * FROM `tbl_category` WHERE `type_id`=1
SELECT * FROM `tbl_category` WHERE `type_id`=0
---
	public function actionWithSubCategory() {
		$localarray = [ ];
		$onlinearray = [ ];
		$data = [ ];
		$onlineModel = Category::find ()->where ( [
				'type_id' => Category::ONLINE_SERIVICE
		] )->all ();
		$localModel = Category::find ()->where ( [
				'type_id' => Category::LOCAL_SERVICE
		] )->all ();