protected/modules/api/controllers/UserController.php

	public function actionLogin() {
		$data = [ ];
		$model = new LoginForm ();
        if ($model->load ( Yii::$app->request->post () )) {
        	$user = User::findByUsername ( $model->username );
			if ($user) {
				if ($model->login ()) {
					$data ['status'] = self::API_OK;
					$userModel = \Yii::$app->user->identity;
					$user_details = User::find ()->where ( [
							'id' => $userModel->id
					] )->one ();
---
SELECT * FROM `tbl_user` WHERE `id`=32