protected/models/AuthSession.php

INSERT INTO `tbl_auth_session` (`created_by_id`, `auth_code`, `device_token`, `type_id`, `created_on`, `updated_on`) VALUES (32, 'gLmPPC6N0wq88Xr25SLeaMsXeC8TDRRi', 'device_token', 0, '2017-12-29 07:22:19', '2017-12-29 07:22:19')
---
	public static function newSession($model) {
		self::deleteOldSession ( Yii::$app->user->identity->id );

		$auth_session = new AuthSession ();
		$auth_session->created_by_id = Yii::$app->user->identity->id;
        $auth_session->auth_code = self::randomCode ( $count = 32 );
        $auth_session->device_token = $model->device_token;
        $auth_session->type_id = $model->device_type;
        if ($auth_session->save ()) {