protected/models/Category.php

	public function getSubCategory() {
		$data=[];
		$model = SubCategory::find ()->where ( [
				'category_id' => $this->id
		] )->all ();
---
SELECT * FROM `tbl_sub_category` WHERE `category_id`=6

    public function getSubCategoryTitle() {
        $data=[];
        $model = SubCategory::find ()->where ( [
            'category_id' => $this->id
        ] )->all ();
---
SELECT * FROM `tbl_sub_category` WHERE `category_id`=6