protected/models/Job.php

SELECT * FROM `tbl_worker_skill` WHERE (`category_id`=6) AND (`created_by_id`=32)
---
	public function getHourlyRate() {
		$model = WorkerSkill::find ()->where ( [
				'category_id' => $this->category_id,
				'created_by_id' => $this->worker_id
		] )->one ();

SELECT * FROM `tbl_favorites` WHERE (`job_id`=111) AND (`worker_id`=32) AND (`created_by_id`=29)
---
    public function getFavoritesState() {
        $model = Favorites::find ()->where ( [
            'job_id' => $this->id,
            'worker_id' => $this->worker_id,
            'created_by_id' => $this->created_by_id
        ] )->one ();

SELECT COUNT(*) FROM `tbl_bid` WHERE `job_id`=111
---
	public function getBidCount() {
		$model = Bid::find ()->where ( [
				'job_id' => $this->id
		] )->count ();

SELECT AVG(rate) FROM `tbl_rating` WHERE (`user_id`=32) AND (`type_id`=0)
---
    public function getWorkerAverageRating() {
        $model = Rating::find ()->where ( [
            'user_id' => $this->worker_id,
            'type_id' => Rating::TYPE_WORKER
        ] )->average ( 'rate' );

SELECT COUNT(*) FROM `tbl_rating` WHERE (`user_id`=32) AND (`type_id`=0)
---
    public function getWorkerReviewCount() {
        $model = Rating::find ()->where ( [
            'user_id' => $this->worker_id,
            'type_id' => Rating::TYPE_WORKER
        ])->count();

SELECT COUNT(*) FROM `tbl_rating` WHERE (`user_id`=29) AND (`type_id`=1)
---
    public function getCustomerReviewCount() {
        $model = Rating::find ()->where ( [
            'user_id' => $this->created_by_id,
            'type_id' => Rating::TYPE_CUSTOMER
        ])->count();

SELECT AVG(rate) FROM `tbl_rating` WHERE (`user_id`=29) AND (`type_id`=1)
---
    public function getCustomerAverageRating() {
        $model = Rating::find ()->where ( [
            'user_id' => $this->created_by_id,
            'type_id' => Rating::TYPE_CUSTOMER
        ] )->average ( 'rate' );

SELECT * FROM `tbl_service_amount`
---
	public function getServiceFee() {
		$model = ServiceAmount::find ()->one();