protected/models/LoginHistory.php

	public static function add($success = true, $user = null, $failer_reason = null) {
		$model = new LoginHistory ();
		$model->user_id = $user != null ? $user->id : 1;
		$model->user_ip = \Yii::$app->request->getUserIP ();
		$model->user_agent = \Yii::$app->request->getUserAgent ();
		$model->code = isset(\Yii::$app->request->referrer)?\Yii::$app->request->referrer:'';
		$model->type_id = \Yii::$app->request->isAjax ? 1 : 0;
		$model->state_id = $success ? 1 : 0;
		$model->failer_reason = is_array ( $failer_reason ) ? json_encode($failer_reason ) : $failer_reason;
		if (! $model->save ()) {
---
INSERT INTO `tbl_login_history` (`user_id`, `user_ip`, `user_agent`, `code`, `type_id`, `state_id`, `failer_reason`, `created_on`) VALUES (32, '192.168.12.229', 'KindWorker/1.0 (com.kindworker.com.KindWorker; build:1; iOS 10.3.1) Alamofire/4.5.1', '', 0, 1, NULL, '2017-12-29 07:22:11')