protected/models/SubCategory.php

SELECT * FROM `tbl_worker_skill` WHERE (`sub_category_id`=29) AND (`created_by_id` IS NULL)
---
	public function workerSkill() {
		$workerSkill = WorkerSkill::find ()->where ( [
				'sub_category_id' => $this->id,
				'created_by_id' => \yii::$app->user->id
		] )->one ();