protected/models/User.php

	public function getWorkerSkillDetail() {
		$model = WorkerSkill::find ()->where ( [
				'created_by_id' => $this->id
		] )->all ();
---
SELECT * FROM `tbl_worker_skill` WHERE `created_by_id`=32

	public static function findIdentity($id) {
		return static::findOne ( [
				'id' => $id,
				'state_id' => self::STATE_ACTIVE
		] );
---
SELECT * FROM `tbl_user` WHERE (`id`=29) AND (`state_id`=1)

	public static function findByUsername($username) {
		return static::findOne ( [
				'email' => $username
		] );
---
SELECT * FROM `tbl_user` WHERE `email`='KindWorkerb@gmail.com'