protected/models/WorkerSkill.php

	public function getCommission() {
		$model = Commission::find ()->one ();
---
SELECT * FROM `tbl_commission`

	public function getWorkerAvgRating($id) {
		$model = Rating::find ()->where ( [
				'user_id' => $id,
                'type_id' => Rating::TYPE_WORKER
		] )->average ( 'rate' );
---
SELECT AVG(rate) FROM `tbl_rating` WHERE (`user_id`=32) AND (`type_id`=0)